esp-arduino-libs/ESP32_Display_Panel/test_apps/panel/sdkconfig.ci.espressif_esp32_s3_lcd_ev_board_v1_5
CONFIG_IDF_TARGET="esp32s3"
CONFIG_BOARD_MANUFACTURER_ALL=y
CONFIG_BOARD_ESP32_S3_LCD_EV_BOARD_V1_5=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
# Enable the XIP-PSRAM feature, so the ext-mem cache won't be disabled when SPI1 is operating the main flash
# For v5.2 and below
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
# For v5.3 and above
CONFIG_SPIRAM_XIP_FROM_PSRAM=y

# Used in conjunction with "RGB Bounce Buffer"
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
